app/controllers/orders_controller.rb

SELECT * FROM `orders` WHERE (`orders`.`id` = 49)
---
  def edit
    @order = Order.find(params[:id])