app/controllers/users_controller.rb

SELECT * FROM `orders` WHERE (`orders`.user_id = 10) ORDER BY created_at DESC LIMIT 0, 20
---
  def show
    @user = self.current_user
    @orders =self.current_user.orders.paginate :order=>"created_at DESC", :page=>params[:page],:per_page=>20

INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('b7bb1068d7b0696f20c731cc95694e126e7f7466', '2010-09-18 02:57:44', NULL, '2fa36a115d896d9ef772ddf4f6dc838e867cb08f', NULL, '2010-09-18 02:57:44', '4a07231d42920972efe1c3c829f2b6388c33fd8c', NULL, 'landy', 'landy@163.com')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save