app/controllers/welcome_controller.rb

  def today
    @product = Product.find(:first,:conditions=>"status=1", :order=>'created_at desc')
---
SELECT * FROM `products` WHERE (status=1) ORDER BY created_at desc LIMIT 1

  def yesterday
    @products = Product.paginate :order=>"created_at DESC", :page=>params[:page],:per_page=>8
---
SELECT * FROM `products` ORDER BY created_at DESC LIMIT 0, 8

  def add_to_cart
    session[:cart] = nil
    if logged_in?
      begin
        product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 2)

  def add_to_order
    @order = Order.new
    @order.user = current_user
    @order.product = Product.find(params[:product_id])
    @order.order_price = params[:order_price]
    @order.phone = params[:phone]
    if @order.save
---
SELECT * FROM `products` WHERE (`products`.`id` = 2)
SELECT * FROM `users` WHERE (`users`.`id` = 6) LIMIT 1
INSERT INTO `orders` (`order_price`, `address`, `discount`, `created_at`, `product_id`, `quantity`, `updated_at`, `pay_type`, `user_id`, `phone`, `is_pay`) VALUES(20.0, NULL, NULL, '2010-09-14 14:45:56', 2, NULL, '2010-09-14 14:45:56', NULL, 6, '43423', NULL)
UPDATE `products` SET `updated_at` = '2010-09-14 14:45:56', `sold_count` = 4 WHERE `id` = 2